In [4]:
%reload_ext sql

#Connect the notebook with the database
%sql postgresql://user:password@localhost:5432/postgres

### You are given the table viewership. 
### Define "mobile" as the sum of tablet and laptop viewership numbers. Write a query to compare the viewership on desktop vs mobile devices.

In [5]:
%%sql
SELECT * FROM viewership LIMIT 10;

 * postgresql://user:***@localhost:5432/postgres
10 rows affected.

[(101, 'laptop', datetime.datetime(2025, 8, 18, 9, 24, 44, 224769)),
 (102, 'desktop', datetime.datetime(2025, 8, 19, 9, 24, 44, 224769)),
 (103, 'laptop', datetime.datetime(2025, 8, 20, 9, 24, 44, 224769)),
 (104, 'laptop', datetime.datetime(2025, 8, 21, 9, 24, 44, 224769)),
 (105, 'laptop', datetime.datetime(2025, 8, 22, 9, 24, 44, 224769)),
 (106, 'tablet', datetime.datetime(2025, 8, 23, 9, 24, 44, 224769)),
 (107, 'laptop', datetime.datetime(2025, 8, 24, 9, 24, 44, 224769)),
 (108, 'desktop', datetime.datetime(2025, 8, 25, 9, 24, 44, 224769)),
 (109, 'tablet', datetime.datetime(2025, 8, 26, 9, 24, 44, 224769)),
 (110, 'laptop', datetime.datetime(2025, 8, 27, 9, 24, 44, 224769))]

In [6]:
%%sql
SELECT 
    SUM(CASE WHEN device_type = 'tablet' OR device_type = 'laptop' THEN 1 ELSE 0 END) AS mobile_devices,
    SUM(CASE WHEN device_type = 'desktop' THEN 1 ELSE 0 END) AS laptop_devices
FROM viewership

 * postgresql://user:***@localhost:5432/postgres
1 rows affected.

[(35, 15)]